In [1]:
import pandas as pd

In [2]:
data = {'name': ['Alish','Bob','Charlie'], 'age': [12, 23, 40]}
df = pd.DataFrame(data)

In [3]:
df.head()

      name  age
0    Alish   12
1      Bob   23
2  Charlie   40

In [5]:
df.at[1,'age'] = 26
df.head()

      name  age
0    Alish   56
1      Bob   26
2  Charlie   40

In [6]:
df.loc[0,'age'] = 12
df.head()

      name  age
0    Alish   12
1      Bob   26
2  Charlie   40

In [8]:
df.columns

Index(['name', 'age'], dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [11]:
df.age

#df['age']

0    12
1    26
2    40
Name: age, dtype: int64

In [12]:
df['height'] = [165,180,195]
df.head()

      name  age  height
0    Alish   12     165
1      Bob   26     180
2  Charlie   40     195

In [13]:
df['test'] = [2,3,'']
df.head()

      name  age  height test
0    Alish   12     165    2
1      Bob   26     180    3
2  Charlie   40     195

In [14]:
df.isnull()

    name    age  height   test
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [15]:
import numpy as np

df['test'] = [2, np.nan, 3]

In [16]:
df.head()

      name  age  height  test
0    Alish   12     165   2.0
1      Bob   26     180   NaN
2  Charlie   40     195   3.0

In [17]:
df.isna()

    name    age  height   test
0  False  False   False  False
1  False  False   False   True
2  False  False   False  False

In [19]:
df['gender'] = 'male'
df.head()

# this acts as a broadcasting thus assigns male to every element in the dataframe

      name  age  height  test gender
0    Alish   12     165   2.0   male
1      Bob   26     180   NaN   male
2  Charlie   40     195   3.0   male

In [24]:
df.loc[3] = ['Aastha', 22, 141, 4, 'female']
df.loc[4] = ['Nabin', 23, np.nan, 5, 'male']

In [25]:
df.head()

      name  age  height  test  gender
0    Alish   12   165.0   2.0    male
1      Bob   26   180.0   NaN    male
2  Charlie   40   195.0   3.0    male
3   Aastha   22   141.0   4.0  female
4    Nabin   23     NaN   5.0    male

In [26]:
df.isna()

    name    age  height   test  gender
0  False  False   False  False   False
1  False  False   False   True   False
2  False  False   False  False   False
3  False  False   False  False   False
4  False  False    True  False   False

In [27]:
df.isna().sum()

name      0
age       0
height    1
test      1
gender    0
dtype: int64